# [1,60,30,90.100,20,70.59.69.71,80,84]
# for a in [1,60,30,90,100,20,70,59,69,71,80,84]:
#     if(a < 60):
#         print(a,"不及格")
#     elif(a >= 60 and a < 70):
#         print(a, "及格")
#     elif(a>=70 and a<80):
#         print(a,"良好")
#     elif(a>=80):
#         print(a,"优秀")
#成绩0-59不及格，60-70及格 70-80 良好 80以上是优秀    [90,100,81,84]判断下改组成绩是否全部都是优秀

# for b in [90,100,81,84,60]:
#     c = 1
#     # for j in range(80,b):
#     if (b>80):
#         c =c+1
# if(c == 5 ):
#      print(b,"全部优秀")
# else:
#      print(b ,"干巴得")
#"01010010001110001001001010101010010101" 计算下几个0 几个1
# c = 0
# b = 0
# for a in "01010010001110001001001010101010010101":
#     if(a == "0"):
#         b= b+1
#     else:
#         c = c+1
# print(b,"个圈圈",c,"根棍子")中断
#求1+2+3+4...+100
# i = 1
# o = 0
# while(i<101):
#     o = i + o
#     i = i+1
# print(o)
#     break

# for a in range(1,101):
#     o = o + a
# print(o)
# i = 1
# a = 1
# while(i<11):
#     a = a * i
#     i = i + 1
# print(a)
# a="小绵羊找毛毛虫吃"
# print(a [-3:])
# print(a[:4])
# c = '["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]'
# print(c[1:-1] )
# n = c[1:-1]
# print(n[1:-1] )
# s = n[1:-1]
# d = s.split('" , "')
# print(d)
# 按照扑克牌的规则，现在有6张牌，只要5张
# 黑桃（S）红桃（H）方块（D）梅花（C）
# 牌：2.3.4.5.6.7.8.9.10.J.Q.K.A
# 数据库存的是下面格式的数据，写脚本验证满足3带2的牌型
# [''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']
# ["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]
# ["C2" , "D13" , "D2" , "H2" , "H9" , "S13"]
# a = '''[''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']'''
# # 替换字符
# a = a.replace("''",'"')
# print(a)
# print(a[2:-2])
# a = a[2:-2]
# # 切片
# b = a.split('" , "')
# print(b)
# # 统计字符数
# a = 1,2,3,4,5,6,7,8,9
# print(len(a))
# [''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']
# ["C9" , "D6" , "D9" , "H13" , "H9" , "S7"]
# ["C2" , "D13" , "D2" , "H2" , "H9" , "S13"]
a ='''[''D1'' , ''H1'' , ''H10'' , ''H7'' , ''S1'' , ''S7'']'''
a= a.replace("''",'"')
print(a)
print(a[2:-2])
a=(a[2:-2])
print(a)
b= a.split('" , "')
print(b)
c={}
for i in b :
    d=i[1:]
    print(d)
    if(d in c):
        c[d] += 1
    else:
        c[d] = 1
print(c)
s1 = 0
s2 = 0
for key in c:
    if(c[key] == 3):
        s1 = 1
    if(c[key] == 2 ) :
        s2 = 1
if(s1==1 and s2 == 1):
    print("柑橘")
else:
    print("杨桃")